docs/design-patterns.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-17 sex 15:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Design Patterns</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Bruno Coimbra (b-coimbra)" />
<link rel="stylesheet" type="text/css" href="https://b-coimbra.github.io/org-scribbler-theme/src/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Design Patterns
<br />
<span class="subtitle">Design patterns are typical solutions to common problems in software design.</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga7cb021">Creational Patterns</a>
<ul>
<li><a href="#org2c775f2">Factory Method</a></li>
<li><a href="#org8789c91">Abstract Factory</a></li>
<li><a href="#org1077743"><span class="todo TODO">TODO</span> Builder</a></li>
<li><a href="#orgc5ec680"><span class="todo TODO">TODO</span> Prototype</a></li>
<li><a href="#org6e47bfb">Singleton</a></li>
</ul>
</li>
<li><a href="#orgb8891d8"><span class="todo TODO">TODO</span> Structural Patterns</a>
<ul>
<li><a href="#org6e9275f">Adaptive</a></li>
<li><a href="#orgab12c22">Bridge</a></li>
<li><a href="#org7c6dad2">Composite</a></li>
<li><a href="#org1c7818d">Decorator</a></li>
<li><a href="#org3cad8c5">Facade</a></li>
<li><a href="#org96dd88c">Flyweight</a></li>
<li><a href="#org2f85793">Proxy</a></li>
</ul>
</li>
<li><a href="#org20052f6"><span class="todo TODO">TODO</span> Behavioral Patterns</a>
<ul>
<li><a href="#org5e7367e">Chain of Responsibility</a></li>
<li><a href="#org16258e2">Command</a></li>
<li><a href="#org9caedd6">Interpreter</a></li>
<li><a href="#org7e55da6">Iterator</a></li>
<li><a href="#org71b85f6">Mediator</a></li>
<li><a href="#org9632477">Memento</a></li>
<li><a href="#org30e17d6">Observer</a></li>
<li><a href="#orga78142a">State</a></li>
<li><a href="#org5c00f8f">Strategy</a></li>
<li><a href="#org58520d4">Visitor</a></li>
<li><a href="#orgdde0d35">Template Method</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Each pattern is like a blueprint that you can customize to solve a particular design problem in your code.
</p>

<div id="outline-container-orga7cb021" class="outline-2">
<h2 id="orga7cb021">Creational Patterns</h2>
<div class="outline-text-2" id="text-orga7cb021">
</div>
<div id="outline-container-org2c775f2" class="outline-3">
<h3 id="org2c775f2">Factory Method</h3>
<div class="outline-text-3" id="text-org2c775f2">
<p>
This creates a set of related objects or dependent objects.
</p>

<ul class="org-ul">
<li>An abstract factory pattern acts as a super-factory that creates other factories.</li>
<li><p>
An abstract factory interface is responsible for creating a set of related objects or dependent objects
without specifying their concrete classes.
</p>

<p>
<b>Basically, think in terms of abstracting the methods and properties of a UML diagram</b>
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org8789c91" class="outline-3">
<h3 id="org8789c91">Abstract Factory</h3>
<div class="outline-text-3" id="text-org8789c91">
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #cc6666; font-weight: bold;">interface</span> <span style="color: #d3869b;">Door</span> {
    <span style="color: #777777;">getDescription</span>(): <span style="color: #cc6666; font-weight: bold;">void</span>;
}

<span style="color: #cc6666; font-weight: bold;">class</span> <span style="color: #d3869b;">WoodenDoor</span> <span style="color: #cc6666; font-weight: bold;">implements</span> <span style="color: #d3869b;">Door</span>
{
    <span style="color: #cc6666; font-weight: bold;">public</span> <span style="color: #cc6666; font-weight: bold;">function</span> <span style="color: #777777;">getDescription</span>() {
        <span style="color: #d3869b;">console</span>.<span style="color: #777777;">log</span>(<span style="color: #476562;">"I am a wooden door"</span>);
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org1077743" class="outline-3">
<h3 id="org1077743"><span class="todo TODO">TODO</span> Builder</h3>
</div>

<div id="outline-container-orgc5ec680" class="outline-3">
<h3 id="orgc5ec680"><span class="todo TODO">TODO</span> Prototype</h3>
</div>

<div id="outline-container-org6e47bfb" class="outline-3">
<h3 id="org6e47bfb">Singleton</h3>
<div class="outline-text-3" id="text-org6e47bfb">
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #cc6666; font-weight: bold;">public</span> Analytics {
    <span style="color: #cc6666; font-weight: bold;">private</span> <span style="color: #cc6666; font-weight: bold;">static</span> _instance: <span style="color: #d3869b;">Analytics</span>;

    <span style="color: #cc6666; font-weight: bold;">private</span> <span style="color: #777777;">Analytics</span>() { }

    <span style="color: #cc6666; font-weight: bold;">public</span> <span style="color: #cc6666; font-weight: bold;">static</span> <span style="color: #777777;">getInstance</span>(): <span style="color: #d3869b;">Analytics</span> {
        <span style="color: #cc6666; font-weight: bold;">if</span> (!Analytics._instance)
            Analytics._instance = <span style="color: #cc6666; font-weight: bold;">new</span> <span style="color: #d3869b;">Analytics</span>();

        <span style="color: #cc6666; font-weight: bold;">return</span> Analytics._instance;
    }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb8891d8" class="outline-2">
<h2 id="orgb8891d8"><span class="todo TODO">TODO</span> Structural Patterns</h2>
<div class="outline-text-2" id="text-orgb8891d8">
</div>
<div id="outline-container-org6e9275f" class="outline-3">
<h3 id="org6e9275f">Adaptive</h3>
</div>

<div id="outline-container-orgab12c22" class="outline-3">
<h3 id="orgab12c22">Bridge</h3>
</div>

<div id="outline-container-org7c6dad2" class="outline-3">
<h3 id="org7c6dad2">Composite</h3>
</div>

<div id="outline-container-org1c7818d" class="outline-3">
<h3 id="org1c7818d">Decorator</h3>
</div>

<div id="outline-container-org3cad8c5" class="outline-3">
<h3 id="org3cad8c5">Facade</h3>
</div>

<div id="outline-container-org96dd88c" class="outline-3">
<h3 id="org96dd88c">Flyweight</h3>
</div>

<div id="outline-container-org2f85793" class="outline-3">
<h3 id="org2f85793">Proxy</h3>
</div>
</div>

<div id="outline-container-org20052f6" class="outline-2">
<h2 id="org20052f6"><span class="todo TODO">TODO</span> Behavioral Patterns</h2>
<div class="outline-text-2" id="text-org20052f6">
</div>
<div id="outline-container-org5e7367e" class="outline-3">
<h3 id="org5e7367e">Chain of Responsibility</h3>
</div>

<div id="outline-container-org16258e2" class="outline-3">
<h3 id="org16258e2">Command</h3>
</div>

<div id="outline-container-org9caedd6" class="outline-3">
<h3 id="org9caedd6">Interpreter</h3>
</div>

<div id="outline-container-org7e55da6" class="outline-3">
<h3 id="org7e55da6">Iterator</h3>
</div>

<div id="outline-container-org71b85f6" class="outline-3">
<h3 id="org71b85f6">Mediator</h3>
</div>

<div id="outline-container-org9632477" class="outline-3">
<h3 id="org9632477">Memento</h3>
</div>

<div id="outline-container-org30e17d6" class="outline-3">
<h3 id="org30e17d6">Observer</h3>
</div>

<div id="outline-container-orga78142a" class="outline-3">
<h3 id="orga78142a">State</h3>
</div>

<div id="outline-container-org5c00f8f" class="outline-3">
<h3 id="org5c00f8f">Strategy</h3>
</div>

<div id="outline-container-org58520d4" class="outline-3">
<h3 id="org58520d4">Visitor</h3>
</div>

<div id="outline-container-orgdde0d35" class="outline-3">
<h3 id="orgdde0d35">Template Method</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-09-13 seg 00:00</p>
<p class="author">Author: Bruno Coimbra (b-coimbra)</p>
<p class="date">Created: 2021-09-17 sex 15:13</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
